app/views/index/home.html.erb

SELECT "gossips".* FROM "gossips"
---
<div class="row">
<% Gossip.all.each do |gossip| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---

        <%  if current_users.first_name==gossip.user.try(:first_name) %>