app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 195], ["LIMIT", 1]]
---
def current_users
  @current_users ||= User.find(session[:user_id]) if session[:user_id]