app/controllers/gossips_controller.rb

  def show
    # @gossip = Gossip.all.find_by(id:params[:id])
    @gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]

    def create
      @gossip = Gossip.new(title:params[:title], content:params[:content], user:current_users)
      if @gossip.save
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "a"], ["content", "a"], ["user_id", 195], ["created_at", "2021-11-04 21:38:41.202831"], ["updated_at", "2021-11-04 21:38:41.202831"]]